#+TITLE:     CL Spacetime 
#+AUTHOR:    William Clifford
#+EMAIL:     wobh@yahoo.com
#+DATE:      2014-11-08 Sat
#+DESCRIPTION: Simple spacetime physics calculator in Common Lisp
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:6 num:nil toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:

**** The problem

I said I was going to define a fundamental minimum distance unit
of 1. But math has thwarted me. You see, that works fine for distances
in a single dimension, but as soon as I added even one more, I run up
against an ancient discovery and confoundment of incommeasurable
things. The diagonal of a square cannot be rationally compared to a
side.

#+BEGIN_SRC lisp
  (defmethod c-distance ((v1 vector))
    "Distance of cartesian velocity vector"
    (labels ((square (n) (expt n 2)))
      (sqrt (reduce #'+ (map 'list #'square (bases v1))))))
#+END_SRC

What does this mean for our velocities? What does this mean for our
minimum length?

The solution that has come to us over the millenia is to invent
"irrational" numbers. This is a good solution, but we've been faced
with a practical problem of expressing their values in a convenient
way. The popular solution is the decimal expansion which carries out a
rationalization for some degree of precision and then stop, supposing
that the loss of precision after that point is probably acceptable.

| pwr | 1 |         2 |         3 |         4 |         5 |         6 |
|-----+---+-----------+-----------+-----------+-----------+-----------|
| 1/1 | 1 |         2 |         3 |         4 |         5 |         6 |
| 1/2 | 1 | 1.4142136 | 1.7320508 |           | 2.2360680 | 2.4494897 |
| 1/3 | 1 | 1.2599210 | 1.4422496 |           | 1.7099759 | 1.8171206 |
| 2/3 | 1 | 1.5874011 | 2.0800838 | 2.5198421 | 2.9240177 | 3.3019272 |
| 1/4 | 1 | 1.1892071 | 1.3160740 |           | 1.4953488 | 1.5650846 |
| 3/4 | 1 | 1.6817928 | 2.2795071 | 2.8284271 | 3.3437015 | 3.8336586 |
| 1/5 | 1 | 1.1486984 | 1.2457309 | 1.3195079 | 1.3797297 | 1.4309691 |
| 2/5 | 1 | 1.3195079 | 1.5518456 |           | 1.9036539 | 2.0476725 |
| 3/5 | 1 | 1.5157166 | 1.9331820 | 2.2973967 | 2.6265278 | 2.9301561 |
| 4/5 | 1 | 1.7411011 | 2.4082247 | 3.0314331 | 3.6238983 | 4.1929627 |
| 1/6 | 1 | 1.1224620 | 1.2009370 | 1.2599210 | 1.3076605 | 1.3480062 |
| 5/6 | 1 | 1.7817974 | 2.4980495 | 3.1748021 | 3.8236225 | 4.4510183 |
| 1/7 | 1 | 1.1040895 | 1.1699308 | 1.2190137 | 1.2584990 | 1.2917083 |
| 2/7 | 1 | 1.2190137 | 1.3687381 |           | 1.5838196 | 1.6685104 |
| 3/7 | 1 | 1.3459002 | 1.6013289 | 1.8114473 | 1.9932353 | 2.1552289 |
| 4/7 | 1 | 1.4859943 | 1.8734440 | 2.2081790 | 2.5084846 | 2.7839271 |
| 5/7 | 1 | 1.6406707 | 2.1917999 | 2.6918004 | 3.1569252 | 3.5960218 |
| 6/7 | 1 | 1.8114473 | 2.5642542 | 3.2813414 | 3.9729870 | 4.6450114 |
#+TBLFM: @2$2..@>$>=@1^($1)

I find this state of affairs somewhat unsatisfying. The integers are
all founded upon 1. The rationals founded upon the prime integers. But
these "irrational" numbers are their own unique numerism, if you will,
as foundational as 1 is to the integers, in their ability to produce
unique values. (

Presently, I have only enough math chops to be aware of this. I don't
have the Lisp chops to implement what mathematician's generally do
with irrationals which is to ignore the value of the decimal expansion
and deal with it symbolically. I'll have to look into that.

